app/controllers/files_controller.rb

def index
  @files = current_user.uploaded_files.order(created_at: :desc)
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."user_id" = ? ORDER BY "uploaded_files"."created_at" DESC  [["user_id", 1]]

def create
  @file = current_user.uploaded_files.build(file_params)
  if @file.save
---
INSERT INTO "uploaded_files" ("title", "description", "content_type", "share_token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

def set_file
  @file = current_user.uploaded_files.find(params[:id])
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."user_id" = ? AND "uploaded_files"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]