app/controllers/shared_files_controller.rb

SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."share_token" = ? LIMIT ?  [["share_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def show
    @file = UploadedFile.find_by!(share_token: params[:token])