app/models/uploaded_file.rb

SELECT 1 AS one FROM "uploaded_files" WHERE "uploaded_files"."share_token" = ? LIMIT ?  [["share_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_share_token
    return if share_token.present?
    loop do
      token = SecureRandom.alphanumeric(6)
      unless UploadedFile.exists?(share_token: token)